_orgs/_posts/algorithms/2014-05-25-algorithms-family.org
#+TITLE:     算法之家
#+AUTHOR:    赵仁贵(Rengui Zhao)
#+EMAIL:     zrg1390556487@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:http://cs3.swfc.edu.cn/~20121156044/.org-info.js />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://cs3.swfu.edu.cn/~20121156044/.org-manual.css" />
#+HTML_HEAD_EXTRA: <style>body {font-size:14pt} code {font-weight:bold;font-size:100%; color:darkblue}</style>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+BEGIN_EXPORT HTML
---
layout: post
title: 算法之家
author: zrg
comments: false
description: 算法...
categories:
- algorithms
tags:
- 算法之家
photos:
---
#+END_EXPORT

# (setq org-export-html-use-infojs nil)
zrg1390556487@gmail.com
# (setq org-export-html-style nil)

* 初级LV.1
** Hello World
   #+NAME: Hello World
   #+BEGIN_SRC C
#include<stdio.h>
void main(){
	printf("Hello World!");
}
   #+END_SRC
** a+b
   #+NAME: a+b
   #+BEGIN_SRC C
#include<stdio.h>
void main(){
	int a,b;
	printf("Please enter two integers separated by commas!\n");
	printf("a=");
	scanf("%d",&a);
	printf("b=");
	scanf("%d",&b);
	printf("a+b=%d\n",a+b);
}
   #+END_SRC
** 大小写转换
   #+NAME: 大小写转换
   #+BEGIN_SRC C
#include<stdio.h>
#include<string.h>
/**
 * Conversion
 * a-z <--> A-Z
 */
//init
char convert(char ch);
//main
void main(){
	int i,j;
	int n,length;
	char arr[300];
	printf("Please enter n value.\n");
	scanf("%d",&n);
	for(i=0;i<n;i++){
		gets(arr);
		length=strlen(arr);
		for(j=0;j<=n;j++){
			arr[j]=convert(arr[j]);
		}
		for(j=0;j<length;j++){
			putchar(arr[j]);
		}
	}
}
//convert
char convert(char ch){
	if(ch>='a'&&ch<='z'){
		return ch-32;
	}else if(ch>='A'&&ch<='Z'){
		return ch+32;
	}else{
		return ch;
	}
}
   #+END_SRC
** 水仙花数
   #+NAME: 水仙花数
   #+BEGIN_SRC C
#include<stdio.h>
/**
 * 水仙花数(Narcissus number)
 * 描述：如果一个三位数的每个数位的三次方和就是本身。
 * */
int isYes(int n);
void main(){
	int l,m,n,flag;
	printf("Please enter 3-digit interger,Separated by commas!\n");
	while(scanf("%d,%d",&m,&n)!=EOF){
		flag=0;
		for(l=m;l<=n;l++){
			if(isYes(l)){
				flag=1;
				printf("%d ",l);
			}
		}
		if(flag==0){
			printf("No!");
		}
	}
}
int isYes(int n){
	int i,j,k;
	i=n/100;//百位
	j=n/10%10;//十位
	k=n%10;//个位
	if(n==i*i*i+j*j*j+k*k*k){
		return 1;
	}else{
		return 0;
	}
}
   #+END_SRC
** 青蛙王子
   #+NAME: 青蛙王子
   #+BEGIN_SRC C
#include<stdio.h>
/**
 * 一个王子被巫师诅咒，……
 * */
void main(){
	unsigned int a,b,c,temp,min;
	while(scanf("%u %u %u",&a,&b,&c),a!=0||b!=0||c!=0){
		if(a==0&&b==0){
			printf("No\n");
			continue;
		}
		if(b>a){
			temp=a;
			a=b;
			b=temp;
		}
		if(b==0){
			min=a;
		}
		if(a==b){
			min=a;	
		}
		while(a>b&&b!=0){
			temp=a-b;
			if(temp>b){
				a=temp;
			}else if(temp<b){
				a=b;
				b=temp;	
			}else{
				min=temp;
				break;
			}
		}
		if((c%min)==0){
			printf("Yes\n");
		}else{
			printf("No\n");
		}
	}
}
   #+END_SRC
** 海明距离
   #+NAME: 海明距离
   #+BEGIN_SRC C
#include<stdio.h>
/**
 * 海明距离(Haiming Distance)
 * 二进制情况下，一个整数变成另一个整数需要翻转的位数。
 * */
void main(){
	int x,y,m,n;
	int dist=0;
	printf("Please enter 2-digit integer,Separated by commas!\n");
	scanf("%d,%d",&x,&y);
	while(x!=0||y!=0){
		m=x%2;x=x/2;
		n=y%2;y=y/2;
		if(m!=n){
			dist++;
		}
	}
	printf("x and y [Haiming Distance]:%d",dist);
}
   #+END_SRC
