_posts/algorithms/2014-05-25-algorithms-family.html
---
layout: post
title: 算法之家
author: zrg
comments: false
description: 算法...
categories:
- algorithms
tags:
- 算法之家
photos:
---

<p>
zrg1390556487@gmail.com
</p>

<div id="outline-container-org391ba5e" class="outline-2">
<h2 id="org391ba5e">初级LV.1</h2>
<div class="outline-text-2" id="text-org391ba5e">
</div>
<div id="outline-container-org28c0bc9" class="outline-3">
<h3 id="org28c0bc9">Hello World</h3>
<div class="outline-text-3" id="text-org28c0bc9">
<div class="org-src-container">
<pre class="src src-C" id="orgfaecfa7"><span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdio.h&gt;</span>
<span style="color: #78dce8;">void</span> <span style="color: #a9dc76;">main</span>(){
        printf(<span style="color: #ffd866;">"Hello World!"</span>);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org647f980" class="outline-3">
<h3 id="org647f980">a+b</h3>
<div class="outline-text-3" id="text-org647f980">
<div class="org-src-container">
<pre class="src src-C" id="org61d3e51"><span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdio.h&gt;</span>
<span style="color: #78dce8;">void</span> <span style="color: #a9dc76;">main</span>(){
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">a</span>,<span style="color: #fcfcfa;">b</span>;
        printf(<span style="color: #ffd866;">"Please enter two integers separated by commas!\n"</span>);
        printf(<span style="color: #ffd866;">"a="</span>);
        scanf(<span style="color: #ffd866;">"%d"</span>,&amp;a);
        printf(<span style="color: #ffd866;">"b="</span>);
        scanf(<span style="color: #ffd866;">"%d"</span>,&amp;b);
        printf(<span style="color: #ffd866;">"a+b=%d\n"</span>,a+b);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org20329c6" class="outline-3">
<h3 id="org20329c6">大小写转换</h3>
<div class="outline-text-3" id="text-org20329c6">
<div class="org-src-container">
<pre class="src src-C" id="org0080370"><span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdio.h&gt;</span>
<span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;string.h&gt;</span>
<span style="color: #727072;">/**</span>
<span style="color: #727072;"> * Conversion</span>
<span style="color: #727072;"> * a-z &lt;--&gt; A-Z</span>
<span style="color: #727072;"> */</span>
<span style="color: #727072;">//</span><span style="color: #727072; font-style: italic;">init</span>
<span style="color: #78dce8;">char</span> <span style="color: #a9dc76;">convert</span>(<span style="color: #78dce8;">char</span> <span style="color: #fcfcfa;">ch</span>);
<span style="color: #727072;">//</span><span style="color: #727072; font-style: italic;">main</span>
<span style="color: #78dce8;">void</span> <span style="color: #a9dc76;">main</span>(){
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">i</span>,<span style="color: #fcfcfa;">j</span>;
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">n</span>,<span style="color: #fcfcfa;">length</span>;
        <span style="color: #78dce8;">char</span> <span style="color: #fcfcfa;">arr</span>[300];
        printf(<span style="color: #ffd866;">"Please enter n value.\n"</span>);
        scanf(<span style="color: #ffd866;">"%d"</span>,&amp;n);
        <span style="color: #ff6188;">for</span>(i=0;i&lt;n;i++){
                gets(arr);
                length=strlen(arr);
                <span style="color: #ff6188;">for</span>(j=0;j&lt;=n;j++){
                        arr[j]=convert(arr[j]);
                }
                <span style="color: #ff6188;">for</span>(j=0;j&lt;length;j++){
                        putchar(arr[j]);
                }
        }
}
<span style="color: #727072;">//</span><span style="color: #727072; font-style: italic;">convert</span>
<span style="color: #78dce8;">char</span> <span style="color: #a9dc76;">convert</span>(<span style="color: #78dce8;">char</span> <span style="color: #fcfcfa;">ch</span>){
        <span style="color: #ff6188;">if</span>(ch&gt;=<span style="color: #ffd866;">'a'</span>&amp;&amp;ch&lt;=<span style="color: #ffd866;">'z'</span>){
                <span style="color: #ff6188;">return</span> ch-32;
        }<span style="color: #ff6188;">else</span> <span style="color: #ff6188;">if</span>(ch&gt;=<span style="color: #ffd866;">'A'</span>&amp;&amp;ch&lt;=<span style="color: #ffd866;">'Z'</span>){
                <span style="color: #ff6188;">return</span> ch+32;
        }<span style="color: #ff6188;">else</span>{
                <span style="color: #ff6188;">return</span> ch;
        }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org74a3d55" class="outline-3">
<h3 id="org74a3d55">水仙花数</h3>
<div class="outline-text-3" id="text-org74a3d55">
<div class="org-src-container">
<pre class="src src-C" id="org7910545"><span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdio.h&gt;</span>
<span style="color: #727072;">/**</span>
<span style="color: #727072;"> * &#27700;&#20185;&#33457;&#25968;(Narcissus number)</span>
<span style="color: #727072;"> * &#25551;&#36848;&#65306;&#22914;&#26524;&#19968;&#20010;&#19977;&#20301;&#25968;&#30340;&#27599;&#20010;&#25968;&#20301;&#30340;&#19977;&#27425;&#26041;&#21644;&#23601;&#26159;&#26412;&#36523;&#12290;</span>
<span style="color: #727072;"> * */</span>
<span style="color: #78dce8;">int</span> <span style="color: #a9dc76;">isYes</span>(<span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">n</span>);
<span style="color: #78dce8;">void</span> <span style="color: #a9dc76;">main</span>(){
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">l</span>,<span style="color: #fcfcfa;">m</span>,<span style="color: #fcfcfa;">n</span>,<span style="color: #fcfcfa;">flag</span>;
        printf(<span style="color: #ffd866;">"Please enter 3-digit interger,Separated by commas!\n"</span>);
        <span style="color: #ff6188;">while</span>(scanf(<span style="color: #ffd866;">"%d,%d"</span>,&amp;m,&amp;n)!=EOF){
                flag=0;
                <span style="color: #ff6188;">for</span>(l=m;l&lt;=n;l++){
                        <span style="color: #ff6188;">if</span>(isYes(l)){
                                flag=1;
                                printf(<span style="color: #ffd866;">"%d "</span>,l);
                        }
                }
                <span style="color: #ff6188;">if</span>(flag==0){
                        printf(<span style="color: #ffd866;">"No!"</span>);
                }
        }
}
<span style="color: #78dce8;">int</span> <span style="color: #a9dc76;">isYes</span>(<span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">n</span>){
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">i</span>,<span style="color: #fcfcfa;">j</span>,<span style="color: #fcfcfa;">k</span>;
        i=n/100;<span style="color: #727072;">//</span><span style="color: #727072; font-style: italic;">&#30334;&#20301;</span>
        j=n/10%10;<span style="color: #727072;">//</span><span style="color: #727072; font-style: italic;">&#21313;&#20301;</span>
        k=n%10;<span style="color: #727072;">//</span><span style="color: #727072; font-style: italic;">&#20010;&#20301;</span>
        <span style="color: #ff6188;">if</span>(n==i*i*i+j*j*j+k*k*k){
                <span style="color: #ff6188;">return</span> 1;
        }<span style="color: #ff6188;">else</span>{
                <span style="color: #ff6188;">return</span> 0;
        }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org73a728f" class="outline-3">
<h3 id="org73a728f">青蛙王子</h3>
<div class="outline-text-3" id="text-org73a728f">
<div class="org-src-container">
<pre class="src src-C" id="orgf3b9561"><span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdio.h&gt;</span>
<span style="color: #727072;">/**</span>
<span style="color: #727072;"> * &#19968;&#20010;&#29579;&#23376;&#34987;&#24043;&#24072;&#35781;&#21650;&#65292;&#8230;&#8230;</span>
<span style="color: #727072;"> * */</span>
<span style="color: #78dce8;">void</span> <span style="color: #a9dc76;">main</span>(){
        <span style="color: #78dce8;">unsigned</span> <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">a</span>,<span style="color: #fcfcfa;">b</span>,<span style="color: #fcfcfa;">c</span>,<span style="color: #fcfcfa;">temp</span>,<span style="color: #fcfcfa;">min</span>;
        <span style="color: #ff6188;">while</span>(scanf(<span style="color: #ffd866;">"%u %u %u"</span>,&amp;a,&amp;b,&amp;c),a!=0||b!=0||c!=0){
                <span style="color: #ff6188;">if</span>(a==0&amp;&amp;b==0){
                        printf(<span style="color: #ffd866;">"No\n"</span>);
                        <span style="color: #ff6188;">continue</span>;
                }
                <span style="color: #ff6188;">if</span>(b&gt;a){
                        temp=a;
                        a=b;
                        b=temp;
                }
                <span style="color: #ff6188;">if</span>(b==0){
                        min=a;
                }
                <span style="color: #ff6188;">if</span>(a==b){
                        min=a;  
                }
                <span style="color: #ff6188;">while</span>(a&gt;b&amp;&amp;b!=0){
                        temp=a-b;
                        <span style="color: #ff6188;">if</span>(temp&gt;b){
                                a=temp;
                        }<span style="color: #ff6188;">else</span> <span style="color: #ff6188;">if</span>(temp&lt;b){
                                a=b;
                                b=temp; 
                        }<span style="color: #ff6188;">else</span>{
                                min=temp;
                                <span style="color: #ff6188;">break</span>;
                        }
                }
                <span style="color: #ff6188;">if</span>((c%min)==0){
                        printf(<span style="color: #ffd866;">"Yes\n"</span>);
                }<span style="color: #ff6188;">else</span>{
                        printf(<span style="color: #ffd866;">"No\n"</span>);
                }
        }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcbe52a2" class="outline-3">
<h3 id="orgcbe52a2">海明距离</h3>
<div class="outline-text-3" id="text-orgcbe52a2">
<div class="org-src-container">
<pre class="src src-C" id="orgf68bb02"><span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdio.h&gt;</span>
<span style="color: #727072;">/**</span>
<span style="color: #727072;"> * &#28023;&#26126;&#36317;&#31163;(Haiming Distance)</span>
<span style="color: #727072;"> * &#20108;&#36827;&#21046;&#24773;&#20917;&#19979;&#65292;&#19968;&#20010;&#25972;&#25968;&#21464;&#25104;&#21478;&#19968;&#20010;&#25972;&#25968;&#38656;&#35201;&#32763;&#36716;&#30340;&#20301;&#25968;&#12290;</span>
<span style="color: #727072;"> * */</span>
<span style="color: #78dce8;">void</span> <span style="color: #a9dc76;">main</span>(){
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">x</span>,<span style="color: #fcfcfa;">y</span>,<span style="color: #fcfcfa;">m</span>,<span style="color: #fcfcfa;">n</span>;
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">dist</span>=0;
        printf(<span style="color: #ffd866;">"Please enter 2-digit integer,Separated by commas!\n"</span>);
        scanf(<span style="color: #ffd866;">"%d,%d"</span>,&amp;x,&amp;y);
        <span style="color: #ff6188;">while</span>(x!=0||y!=0){
                m=x%2;x=x/2;
                n=y%2;y=y/2;
                <span style="color: #ff6188;">if</span>(m!=n){
                        dist++;
                }
        }
        printf(<span style="color: #ffd866;">"x and y [Haiming Distance]:%d"</span>,dist);
}
</pre>
</div>
</div>
</div>
