_posts/algorithms/2014-05-25-algorithms-family.html
<div id="outline-container-orgfc1cf1b" class="outline-3">
<h3 id="orgfc1cf1b">哈密尔顿距离</h3>
<div class="outline-text-3" id="text-orgfc1cf1b">
<div class="org-src-container">
<pre class="src src-C" id="orgcab303a"><span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdio.h&gt;</span>
<span style="color: #727072;">/**</span>
<span style="color: #727072;"> * &#21704;&#23494;&#23572;&#39039;&#36317;&#31163;</span>
<span style="color: #727072;"> * Hamilton.c</span>
<span style="color: #727072;"> * &#26377;&#20004;&#20010;&#28857;P[x1,y1],Q[x2,y2]&#65292;&#23450;&#20041;&#20854;&#21704;&#23494;&#23572;&#39039;&#36317;&#31163;D=|x1-x2|+|y1-y2|</span>
<span style="color: #727072;"> * */</span>
<span style="color: #78dce8;">void</span> <span style="color: #a9dc76;">main</span>(){
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">x1</span>,<span style="color: #fcfcfa;">y1</span>,<span style="color: #fcfcfa;">x2</span>,<span style="color: #fcfcfa;">y2</span>,<span style="color: #fcfcfa;">temp_x</span>,<span style="color: #fcfcfa;">temp_y</span>;
        printf(<span style="color: #ffd866;">"Please enter 4 numbers,each 2 numbers are Separated by commas.Format:'3,4 5,6'\n"</span>);
        scanf(<span style="color: #ffd866;">"%d,%d %d,%d"</span>,&amp;x1,&amp;y1,&amp;x2,&amp;y2);
        <span style="color: #ff6188;">if</span>(x1&gt;x2){
                temp_x=x1-x2;
        }<span style="color: #ff6188;">else</span>{
                temp_x=x2-x1;
        }
        <span style="color: #ff6188;">if</span>(y1&gt;y2){
                temp_y=y1-y2;
        }<span style="color: #ff6188;">else</span>{
                temp_y=y2-y1;
        }
        printf(<span style="color: #ffd866;">"result:%d\n"</span>,temp_x+temp_y);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org8e7c1db" class="outline-3">
<h3 id="org8e7c1db">数码平方和</h3>
<div class="outline-text-3" id="text-org8e7c1db">
<div class="org-src-container">
<pre class="src src-C" id="orgf907462"><span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdio.h&gt;</span>
<span style="color: #727072;">/**</span>
<span style="color: #727072;"> * &#25968;&#30721;&#24179;&#26041;&#21644;</span>
<span style="color: #727072;"> * &#19968;&#20010;&#25972;&#25968;&#21508;&#20010;&#25968;&#30721;&#30340;&#24179;&#26041;&#21644;&#30340;&#20010;&#20301;&#25968;&#25104;&#20026;&#20998;&#31867;&#20540;&#12290;&#32473;&#20320;&#19968;&#20010;&#21306;&#38388;[a,b]&#65292;&#19968;&#20010;&#25968;&#30721;n&#65292;&#27714;&#36825;&#20010;&#21306;&#38388;[a,b]&#20869;&#30340;&#20998;&#31867;&#20540;n&#12290;</span>
<span style="color: #727072;"> * */</span>
<span style="color: #78dce8;">void</span> <span style="color: #a9dc76;">main</span>(){
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">a</span>,<span style="color: #fcfcfa;">b</span>,<span style="color: #fcfcfa;">c</span>,<span style="color: #fcfcfa;">d</span>,<span style="color: #fcfcfa;">e</span>;
        printf(<span style="color: #ffd866;">"Please enter 3 numbers.\n"</span>);
        scanf(<span style="color: #ffd866;">"%d,%d,%d"</span>,&amp;a,&amp;b,&amp;e);
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">i</span>,<span style="color: #fcfcfa;">j</span>,<span style="color: #fcfcfa;">k</span>,<span style="color: #fcfcfa;">n</span>,<span style="color: #fcfcfa;">f</span>,<span style="color: #fcfcfa;">g</span>;        
        <span style="color: #ff6188;">for</span>(i=0;i&lt;=b;i++){
                g=i;c=i;
                f=0;d=c;
                <span style="color: #ff6188;">for</span>(;d!=0;){
                        c=d%10;
                        f=f+c*c;
                        d=d/10;
                }
                f=f%10;
                <span style="color: #ff6188;">if</span>(f==e){
                        k++;
                }
        }
        printf(<span style="color: #ffd866;">"result:%d\n"</span>,k);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org5357b62" class="outline-3">
<h3 id="org5357b62">统计字符</h3>
<div class="outline-text-3" id="text-org5357b62">
<div class="org-src-container">
<pre class="src src-C" id="org38f264b"><span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdio.h&gt;</span>
<span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;string.h&gt;</span>
<span style="color: #727072;">/**</span>
<span style="color: #727072;"> * Statistics Strings</span>
<span style="color: #727072;"> * &#36755;&#20837;&#19968;&#23383;&#31526;&#20018;&#65292;&#35831;&#25214;&#20986;&#20986;&#29616;&#27425;&#25968;&#26368;&#22810;&#30340;&#22823;&#20889;&#23383;&#27597;&#12290;</span>
<span style="color: #727072;"> * &#37319;&#29992;&#21704;&#24076;&#26144;&#23556;&#24605;&#24819;&#65292;&#25226;A-Z&#26144;&#23556;&#21040;&#21704;&#24076;&#34920;&#20013;&#20445;&#23384;&#20854;&#20986;&#29616;&#30340;&#27425;&#25968;&#65292;&#26368;&#21518;&#36755;&#20986;&#32467;&#26524;&#12290;</span>
<span style="color: #727072;"> * */</span>
<span style="color: #78dce8;">void</span> <span style="color: #a9dc76;">main</span>(){
        <span style="color: #78dce8;">char</span> <span style="color: #fcfcfa;">str</span>[100],<span style="color: #fcfcfa;">z</span>[1000];
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">i</span>,<span style="color: #fcfcfa;">j</span>,<span style="color: #fcfcfa;">k</span>,<span style="color: #fcfcfa;">sum</span>[30],<span style="color: #fcfcfa;">a</span>;
        gets(z);<span style="color: #727072;">//</span><span style="color: #727072; font-style: italic;">&#35835;&#21462;&#23383;&#31526;&#20018;</span>
        memset(sum,0,<span style="color: #ff6188;">sizeof</span>(str));
        <span style="color: #ff6188;">for</span>(i=0;i&lt;strlen(z);i++){
                sum[z[i]-<span style="color: #ffd866;">'A'</span>]++;
        }
        k=0;
        <span style="color: #ff6188;">for</span>(i=0;i&lt;30;i++){
                <span style="color: #ff6188;">if</span>(k&lt;sum[i]){
                        k=sum[i];
                        a=i+<span style="color: #ffd866;">'A'</span>;
                }
        }
        printf(<span style="color: #ffd866;">"%c %d\n"</span>,a,k);  
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org8082bfe" class="outline-3">
<h3 id="org8082bfe">数字塔</h3>
<div class="outline-text-3" id="text-org8082bfe">
<div class="org-src-container">
<pre class="src src-C" id="org1fc391e"><span style="color: #727072;">/**</span>
<span style="color: #727072;"> * Digital Tower</span>
<span style="color: #727072;"> *    1</span>
<span style="color: #727072;"> *   222</span>
<span style="color: #727072;"> *  33333</span>
<span style="color: #727072;"> * */</span>
<span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdio.h&gt;</span>
<span style="color: #78dce8;">void</span> <span style="color: #a9dc76;">main</span>(){
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">n</span>;
        printf(<span style="color: #ffd866;">"Please enter any number!\n"</span>);
        scanf(<span style="color: #ffd866;">"%d"</span>,&amp;n);
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">i</span>,<span style="color: #fcfcfa;">j</span>;

}
</pre>
</div>
</div>
</div>
<div id="outline-container-org3cf65d3" class="outline-3">
<h3 id="org3cf65d3">有多少个1</h3>
<div class="outline-text-3" id="text-org3cf65d3">
<div class="org-src-container">
<pre class="src src-C" id="orgd755938"><span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdio.h&gt;</span>
<span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdlib.h&gt;</span>
<span style="color: #78dce8;">void</span> <span style="color: #a9dc76;">hanoi</span>(<span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">n</span>,<span style="color: #78dce8;">char</span> <span style="color: #fcfcfa;">x</span>,<span style="color: #78dce8;">char</span> <span style="color: #fcfcfa;">y</span>,<span style="color: #78dce8;">char</span> <span style="color: #fcfcfa;">z</span>);
<span style="color: #78dce8;">int</span> <span style="color: #a9dc76;">main</span>(<span style="color: #78dce8;">void</span>){
        hanoi(6,<span style="color: #ffd866;">'A'</span>,<span style="color: #ffd866;">'B'</span>,<span style="color: #ffd866;">'C'</span>);
        <span style="color: #ff6188;">return</span> EXIT_SUCCESS;    
}
<span style="color: #78dce8;">void</span> <span style="color: #a9dc76;">hanoi</span>(<span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">n</span>,<span style="color: #78dce8;">char</span> <span style="color: #fcfcfa;">x</span>,<span style="color: #78dce8;">char</span> <span style="color: #fcfcfa;">y</span>,<span style="color: #78dce8;">char</span> <span style="color: #fcfcfa;">z</span>){
        <span style="color: #ff6188;">if</span>(n==0){

        }<span style="color: #ff6188;">else</span>{
                hanoi(n-1,x,z,y);
                printf(<span style="color: #ffd866;">"%c-&gt;%c,"</span>,x,y);
                hanoi(n-1,z,y,x);
        }
}
</pre>
</div>
</div>
</div>
